## Concat Dataframes

In [2]:
import pandas as pd

india_weather=pd.DataFrame({  #Attribute is DataFrame
    'city':['mumbai','delhi','banglore'],
    'temperature':[32,45,28],
    'humidity':[45,34,67]
})

india_weather

       city  temperature  humidity
0    mumbai           32        45
1     delhi           45        34
2  banglore           28        67

In [3]:
usa_weather=pd.DataFrame({  #Attribute is DataFrame
    'city':['newyork','chicago','orlando'],
    'temperature':[21,19,28],
    'humidity':[5,34,23]
})

usa_weather

      city  temperature  humidity
0  newyork           21         5
1  chicago           19        34
2  orlando           28        23

#### Merging these dfs

In [4]:
pd.concat([india_weather,usa_weather])
#using the index from prev. not continous

       city  temperature  humidity
0    mumbai           32        45
1     delhi           45        34
2  banglore           28        67
0   newyork           21         5
1   chicago           19        34
2   orlando           28        23

In [5]:
pd.concat([india_weather,usa_weather], ignore_index=True)

       city  temperature  humidity
0    mumbai           32        45
1     delhi           45        34
2  banglore           28        67
3   newyork           21         5
4   chicago           19        34
5   orlando           28        23

In [6]:
df = pd.concat([india_weather,usa_weather],keys= ["india","us"])
df
#additional index of name

             city  temperature  humidity
india 0    mumbai           32        45
      1     delhi           45        34
      2  banglore           28        67
us    0   newyork           21         5
      1   chicago           19        34
      2   orlando           28        23

In [7]:
df.loc['india'] #access

       city  temperature  humidity
0    mumbai           32        45
1     delhi           45        34
2  banglore           28        67

In [8]:
df.loc['us']

      city  temperature  humidity
0  newyork           21         5
1  chicago           19        34
2  orlando           28        23

## Appending Dfs as cols

In [9]:
temperature_df=pd.DataFrame({ 
    'city':['newyork','chicago','orlando'],
    'temperature':[32,45,28]
})

temperature_df

      city  temperature
0  newyork           32
1  chicago           45
2  orlando           28

In [10]:
windspeed_df=pd.DataFrame({ 
    'city':['orlando','newyork'],
    'windspeed':[7,12],
   
},index=[2,0])
windspeed_df

      city  windspeed
2  orlando          7
0  newyork         12

In [11]:
#Append these two dataframes as col
df = pd.concat([temperature_df , windspeed_df])
df
# it is rowwise we want col

      city  temperature  windspeed
0  newyork         32.0        NaN
1  chicago         45.0        NaN
2  orlando         28.0        NaN
2  orlando          NaN        7.0
0  newyork          NaN       12.0

In [12]:
df = pd.concat([temperature_df , windspeed_df] ,axis=1)
df
# axis=1 for col append

      city  temperature     city  windspeed
0  newyork           32  newyork       12.0
1  chicago           45      NaN        NaN
2  orlando           28  orlando        7.0

In [13]:
#for right index pass index[] to align rows from dataframes

### Join df by Series

In [14]:
s= pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [16]:
# appending to temperature df
df = pd.concat([temperature_df , s] ,axis=1)
df
# axis=1 for column append

      city  temperature  event
0  newyork           32  Humid
1  chicago           45    Dry
2  orlando           28   Rain